Написать программу, которая будет округлять число до заданного количества знаков после запятой. первое задание.

[11]
print(round(2.562852, 2)) # 2.56
print(round(2.2567532, 3)) # 2.257

2.56
2.257
Написать программу, которая будет находить среднее арифметическое двух чисел и округлять его до целого числа.Задание два ниже.

[12]
n = int(input("Введите количество элементов списка: "))
a = []
for i in range(0, n):
    elem = int(input("Введите элемент списка: "))
    a.append(elem)
avg = sum(a) / n
print("Среднее значение элементов списка",round(avg, 2))
output
Введите количество элементов списка: 2
Введите элемент списка: 24
Введите элемент списка: 12
Среднее значение элементов списка 18.0